[
  {
    "id": "1",
    "content": "Zendaya & Tom Holland. There are lot of speculation weather this cute couple is engaged or not? Well, this lovely couple have a great fun together, and enjoy spending time together, and absolutely willing to say “I do!”, and right now pretty much burning to say so. But the relationship itself has not enough of what is needed to hold a ground for a relationship like marriage. There are some interesting transits of planets right now (and one that will stay for a while throughout all next year) hitting their relationship (and personal planets), that make them think more seriously about, but that’s something that’s passing, as opposed to being fixed. Their Venus is heavily challenged, which is very hard to deal with in intimate relationships, in the long run. They have lot of good will to deal with it tho. Theres not much to keep ground strong enough to sustain relationship like marriage, and considering that the relationship itself has challenging configuration (not just Venus), and need extra support, that there isn’t, not getting married is more likely. Nevertheless, they click at sweet points and that can bind them as a couple for a time being, and in their case more likely as a couple than married couple. Marriage could work, kind of, not conventional one, and I don’t see that fitting their individual settings about marriage, thus not in the line with their relationship that is in itself of unconventional nature, hence works the best way that way, and it’s the only way, as there are not enough support to balance its nature. *They seem as a very new couple. There are no direct links indicating much of involvement in a past lives, as if they are just starting out now, learning to know each other as they go. When they met for the first time they definitely had no that feeling like “I know this person”….”Have we met before?”."
  },
  {
    "id": "2",
    "content": "Kourtney Kardashian & Travis Barker. Seeing Kourtney & Travis chart explains why these two love birds cannot get hands of each other. They really do hit each other’s sweet spots. There’s so much passion here, I mean they can get pregnant just looking at each other, lol. If these two don’t get pregnant now or next year then…idk…it’s highly unlikely tho. Chart shows they do have desire to have a baby, and that same aspect (they will have now for few years) could be very helpful for conceiving. Kourtney and Travis will be expecting their baby soon for sho if not already, wouldn’t surprise me. They seem to be meant to have their little one or…..two… Chart point out, and at many places for him just as for her, how happy they make each other. There’s also a rock solid indication that at one point they will decide to part ways, but on the other hand they have links that support relationship, so maybe they part ways but stay close as if they didn’t. Chart shows him as the one that will feel over burdened for whatever reason that might be, and needing to get away. Maybe, as chart shows, coz he feels very light and frisky with her, and prefers all fun, no much heavy responsibilities. Also, chart indicate that their fights can get very heated, and then follow with very cold distant passive aggressive situation that hits him directly, and one day at one point he just won’t be able to take it anymore. They will part their ways married or not. Most likely married, there are many links indicating it. They both are holding their relationship tight tho, they will do their best to make things work for as long they can."
  },
  {
    "id": "3",
    "content": "Megan Fox & MGK. They do have extra spesh bond, and by special bond I mean totally else than Venus Jupiter conjunction in synastry. Synastry alone means nothing, and it doesn’t tell anything this way these articles are interpreting: instylemagazine, marieclairemag, elleusa… and the list goes on with incorrect, misleading, “astrology” articles like this on couples. On the contrary to what Megs things, they are not a twin flames, that’s totally else, trust me I KNOW what I am talking about. They have some major elements I see only with a married couples, but are not supported enough much. Also. they have a few elements what could be solid indication of durable life long marriage, but the orb is a bit wide. And another element is exact but standing alone afloat. Glued together mostly with a chemistry, and a deeper connection, and elements needed for an actual enduring relationship like marriage are not sufficient. Highly volatile chemistry tho, but with a wrong flow not sustainable for a marriage. Chemistry that is fun in the beginning especially in the bedroom, but can be destructive, damaging, on the long run, coz it doesn’t have the right flow. Not so good for domestic bliss, doesn’t work in the long course of time. If they do marry, it’s going to be hard at one point, and stay hard. They also have lot of Uranus energy generated in contact with each other. It’s electric, energizing, exciting energy, but also destabilizing, abrupt, explosive (in negative sense) and making it hard to have a home together. They have connection from a past life, its visible at many places, but not a clear romantic connection, not standing out like with couples from past lifes that do have it clearly visible. Maybe they were madly in love in a past lifes but never got a chance to be together. Well finally they are now. Now they can deepen their bond, and build solid ground for the next life."
  },
  {
    "id": "4",
    "content": "Sun-Moon Aspects in Composite. The Sun and the Moon aspects in composite (conjunction, trine, square and opposition) are found in composite charts of married couples. The Sun and the Moon are considered to be the two most important celestial bodies, as they represent the fundamental polarity in universe the yin and the yang. Together they represent wholeness. The Sun represents the core essence of one’s personality (the ego), while the Moon represents one’s emotions (the mind). Position of the Sun and the Moon in composite chart is of the utter most importance for the close intimate relationship, in which case the Sun and the Moon aren’t situated randomly, but at the significant spot instead, as it is in the case of marital relationships. In the case of marital relationships, Saturn can be seen in the mix as well, as it is needed for a strong solid stable enduring long-lasting relationship. WITHOUT SATURN IN THE MIX, NO NEED EVEN BOTHER TO LOOK ANY FURTHER IF LOOKING FOR A SERIOUS RELATIONSHIP. Sun conjunction Moon Sun conjunction Moon (or exact to the minute trine is to be read as a conjunction) in composite can be a powerful aspect. You are essentially compatible. There’s a true sense of unity, comfort, as well as underlying sense of support of one another and a strong sense of shared purpose. You have a deep emotional connection, and share similar values and goals. You are emotionally attuned to each other’s needs, and can communicate your feelings with ease and understanding. There is a sense of togetherness, ease, comfort in each other’s presence, and a general feeling of mutual support and encouragement. This aspect is particularly favourable in romantic relationships, and often found in marital relationships, as the Sun and the Moon represent masculine and feminine energy respectively, and their conjunction represents a symbolic marriage, a harmonious union signifying that the two people involved are truly complementary. You are very dynamic couple, and so fused together that you don’t even think in terms of “I” or “Me” but it’s just “We” “Us”. You even think as one. As a result of complementarity you will also be more formidable as a team than individually. You work as a team effectively towards your shared goals, and are supportive of each other through both good and bad times. Sun conjunction Moon aspect is indication of well balanced, harmonious, supportive, emotionally fulfilling, intense, satisfying relationship for both partners, as you complement each other’s needs and desires. It is one of the best aspects to have in a close personal intimate relationships. Sun trine/sextile Moon If exact trine at 120 degrees exactly read it also as a conjunction Sun trine Moon aspect in a composite chart is a powerful aspect. It is an superb indication of a harmonious emotionally intense fulfilling and satisfying relationship as you complement each other’s needs and desires (especially in a case with a exact trine, or exact conjunction). The Sun and the Moon represent the fundamental polarity in universe, such as masculine/feminine, male/female, positive/negative, active/passive, and together they represent the wholeness. Sun trine Moon in composite chart means that as a couple you can experience that same wholeness, which is very powerful binding unifying force. Such a relationship is characterised by a lack of conflicts that is driven by power struggle over dominance within relationship. There is a perfect balance between you as a result of your unifying chemistry as a couple. There won’t be a consistent dominant and assertive role between the two of you (as it is case with Sun square Moon, Sun opposition Moon). Instead, you’ll alternate between taking active and passive roles. And that my friend mirrors what your togetherness truly represents, a partnership between equals. You are emotionally attuned to each other. There is a strong emotional bond, sense of comfort, and general feeling of mutual support and encouragement. You share similar values, goals, and perspectives on life, which can lead to a sense of mutual respect and admiration. This aspect shows balance between the partners’ individuality and togetherness. You support each other’s personal growth and aspirations, while also nurturing your shared goals and dreams. Sun sextile Moon in a composite shows natural affinity for creativity and self-expression. You may find it easy to collaborate on artistic, creative projects, or simply to appreciate each other’s unique perspectives and talents. This can be a source of mutual inspiration and growth within the relationship. With trine or sextile between the Sun and Moon in composite there is also very strong underlying aspect of friendship. You are as much friends as lovers. It is very easy to be ownself with one another. You are able to express yourself freely and openly with each other without feeling the need to hide yourself, as you are perfectly attuned to one another. Sun square Moon Sun and Moon in a square aspect in the composite chart indicates a challenging dynamic between you in terms of your emotional needs. The Sun represents the ego and self-expression, while the Moon represents emotions, feelings, needs. Sun square Moon in composite suggests that there is fundamental tension and conflict within the relationship, and challenge in balancing these two energies, leading to disagreements, power struggles and difficulties in understanding each other’s needs. There is a tendency to focus more on individual needs and desires, which can cause friction as one partner may feel overshadowed or diminished by the other feeling unsupported or invalidated in their emotional needs. This aspect can indicate a lack of emotional compatibility as you have different emotional needs, and struggle to understand and communicate with each other on an emotional level. So in a composite chart a square aspect between the Sun and Moon can manifest in various ways: conflict between the partners individual desires and needs and needs of the relationship as a whole struggle to find common ground or compromise, leading to frequent disagreements suppressed emotions leading to fiery outbursts conflicts between their personal goals need to constantly compete with one another instead being able to work as a team power struggles, relationship out of balance strong attraction, but fundamentally at odds with own needs Relationships that carry this kind of interaction where partners constantly challenge each other as in power struggles, usually have this composite aspect. Some couples tho can thrive in this kind of constant battlefield environment that they find it rather stimulating, it’s kinda their thing. Others can find it exhausting over the time, not exactly what they wish from a relationship, as it’s difficult to establish a chill comfortable dynamic. It depends on your each natal predisposition will you find relationship invigorating or tiring. Sun square Moon can be a very challenging aspect in a relationship. On the other hand, the tension between the Sun and Moon also provide an opportunity for growth as you learn to work through these challenges and find ways to compromise and meet each other’s needs. Also, by acknowledging and addressing conflicting needs and desires, you can deepen understanding of each other and strengthen your connection. Sun opposition Moon Just like with all Sun Moon aspects, this aspect too can be indication of strong attraction and strong emotional connection. The bond can be powerful, but opposition aspect also create friction and challenges in the relationship.This aspect is highly polarizing charged with tension and dynamic of opposing energies. You may feel a strong attraction, but also have difficulty reconciling differences. Push-pull dynamic is at play here, where one partner wants one thing and the other wants something else as you have different needs and desires, which in turn creates tension and conflict within the relationship.. The opposition aspect creates tension between the Sun and Moon energies. The Sun represents the “self” i.e. ego the identity, while the Moon represents the emotions, instincts, and nurturing. When these energies are in opposition, the need for individual expression and the need for emotional security and connection are not working in sync. This tension can create a sense of balance and complementarity in the relationship, if the partners are willing to learn to appreciate and respect each other’s differences, and work together to integrate their opposing energies. The opposition aspect can then help you to become more aware of your own needs and emotions and develop a deeper understanding as well as those of your partners’, through interactions with each other. Also, encourage you to find ways to compromise and work together to find solutions to any conflicts that arise. Sun quincunx Moon Sun quincunx Moon aspect can create a sense of tension and unease in the relationship. This aspect represents a fundamental difference between the partners’ basic needs, wants, and desires. There could be a mismatch in your emotional and psychological needs. It can indicate a lack of understanding each other, and difficulty communicating in the relationship. You may feel like you are not fully understood or acknowledged by the other, thus find communication challenging and that in itself further leads to misunderstandings and conflicts. The Sun quincunx Moon create an underlying sense of restlessness or dissatisfaction in the relationship, as the partners struggle to fully understand and meet each other’s emotional needs. There may be a constant struggle to balance individual needs with the needs of the relationship. This aspect can also provide an opportunity for growth and learning within relationship if the partners are willing to work through their differences and understand each other’s perspectives. If so, you can develop a deeper level of intimacy and trust. Sun quincunx Moon aspect in a composite chart requires effort and understanding from both partners to overcome the challenges it presents."
  },
  {
    "id": "5",
    "content": "Venus-Pluto Aspects in Composite. When you have Venus-Pluto aspect in composite with your partner, you find your partner irresistible. You simple cannot resist one another! It is very deep intense bond. You just can’t live without each other and don’t want to live without each other, to summon it shortly, haha. Venus-Pluto aspects in composite are absolutely the best aspects for love and sex. Venus Pluto aspects in composite chart are responsible for deep emotional and physical intimacy, rapturous sex (with Mars in the mix) enduring love, and undying sexual attraction. Venus-Pluto aspects in composite chart means that you as a couple have a deep love for one another, great sexual attraction and deeply satisfying love life. Composite Venus Conjunct/Trine/Square Composite Pluto If you and your partner have Venus conjunct/trine/square Pluto in composite you are very blessed as you will expirience love in its most transformative form. Venus Pluto in the composite chart shows that both of you will be transformed in this relationship with the transformative power of love, as this connection between you has intensity and power to reach the deepest depths of your being at the highest heights of your love. That is where many song lyrics like “you bring me closer to God” comes from. You arouse soul deep, passionate such intense feelings within each other, that physical intimacy is charged with such intensity that makes your love life incredibly powerful, and beautiful, steamy, and so sweet that is addictive, and you just can’t be without each other, and don’t want to be without each other. You are deeply and intensely involved with each other. This profound connection stimulates intense soul deep feelings and you will want all-or-nothing. Desire to completely “posses” one another, each others’ all, mind and body and soul, comes naturally at this depths of connection this bond binds you. Wanting to possess one another (in a good way) as with this bond that these aspects indicates, is not to be confused with possessiveness that is present in some other connections that comes from a different place, One comes from deep loving place and the other is ego driven from the luck of deep enough connection, where just Mars is involved with Pluto but no Venus in the mix. (Venus Pluto Mars is the perfect mix for the love and sex.) For the two of you it feels natural, deeply loving and sweet wanting to possess one another each other’s all, mind body and soul."
  }
]